##1. Реализовать последовательность {𝐵𝑛} для заданного значения ставки 𝑟 =0.01, 
## используя формулу (5), за период 𝑁 = 200 при 𝐵0 = 1. Построить график;
n = 200
r = 0.01
B = numeric(n)
B[1] = 1
for (i in 2:n) {
  B[i] = (1+r)*B[i-1]
}
plot(B,type="l",col="blue")
##2. Реализовать случайный процесс {𝑆𝑛}, используя формулу (5), при следующих значениях параметров: 
##𝑆0 = 1, 𝑁 = 200, 𝑎 = −0.3, 𝑏 = 0.8, 𝑝 = 0.4.Построить график.
a = -0.3
b = 0.8
p = 0.4
S = numeric(n)
S[1] = 1
for (i in 2:n) {
  bern_sv = rbinom(1,1,p)
  if(bern_sv == 1){
    bern_sv = b
  }
  else if(bern_sv == 0){
    bern_sv = a
  }
  S[i] = (1+bern_sv)*S[i-1]
}
plot(S,type="l",col="blue")
##3. Рассчитать справедливую цену 𝑐𝑎𝑙𝑙-опциона по формуле (7) при следующих значениях параметров:
##𝑆0 = 100, 𝑁 = 10, 𝑎 = −0.3, 𝑏 = 0.8, 𝑟 = 0.2,𝐾 = 100.
n = 10
a = -0.3
b = 0.8
r = 0.2
K = 100
S0 = 100
p_1 = (r-a)/(b-a)
p_2 = ((1+b)/(1+r))*p_1
K0 = 1 + (log(K/(S0*(1+a)**n)))*(log((1+b)/(1+a)))**(-1);K0

B1 = 0
B2 = 0
for(k in K0:n){
  B1 = B1 + (factorial(n)/(factorial(k)*factorial(n-k)))*(p_1**k)*(1-p_1)**(n-k)
  B2 = B2 + (factorial(n)/(factorial(k)*factorial(n-k)))*(p_2**k)*(1-p_2)**(n-k)
}

C = S0*B2 - K*(1+r)**(-n)*B1;C
